app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO `products` (`name`, `price`, `short_description`, `created_at`, `updated_at`) VALUES ('gfdg', 45, 'dfg', '2019-09-18 14:18:38', '2019-09-18 14:18:38')

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `name` = 'Tv', `price` = 4500, `short_description` = 'HDTV', `updated_at` = '2019-09-18 14:18:56' WHERE `products`.`id` = 1

  def destroy
    @product = Product.find(params[:id])
    if @product.delete
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 2